InformationRegisters/ЦеныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныУслуг</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОбработкаТабличнойЧастиВызовСервера/Ext/Module.bsl
Функция ТекущаяЦенаУслуги(Услуга) Экспорт	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныУслугСрезПоследних.Цена КАК Цена,	
		|	ЦеныУслугСрезПоследних.Услуга КАК Услуга
   		 |ИЗ
		|	РегистрСведений.ЦеныУслуг.СрезПоследних КАК ЦеныУслугСрезПоследних
		|ГДЕ
		|	ЦеныУслугСрезПоследних.Услуга = &Услуга";		Запрос.УстановитьПараметр("Услуга", Услуга);		РезультатЗапроса = Запрос.Выполнить();		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл				Возврат ВыборкаДетальныеЗаписи.Цена;				КонецЦикла;		Возврат 0;	КонецФункции
